_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_29 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_30 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_15 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_31 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_32 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_16 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               1048704   
_________________________________________________________________
dropout_17 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_18 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 10)                2570      
_________________________________________________________________
activation_33 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,620,298
Trainable params: 1,620,298
Non-trainable params: 0
_________________________________________________________________
