_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_13 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_14 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_7 (Dropout)          (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_15 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_16 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_8 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_17 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_18 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_9 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_19 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 4, 4, 128)         16512     
_________________________________________________________________
activation_20 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 4, 4, 10)          1290      
_________________________________________________________________
global_average_pooling2d_2 ( (None, 10)                0         
_________________________________________________________________
activation_21 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,144,138
Trainable params: 1,144,138
Non-trainable params: 0
_________________________________________________________________
