_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_43 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_34 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_35 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_19 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_36 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_37 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_20 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               1048704   
_________________________________________________________________
dropout_21 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_22 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_23 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_38 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,686,090
Trainable params: 1,686,090
Non-trainable params: 0
_________________________________________________________________
