_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_5 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_26 (Activation)   (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_27 (Activation)   (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_28 (Activation)   (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 22, 41, 32)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 20, 39, 32)        9248      
_________________________________________________________________
activation_29 (Activation)   (None, 20, 39, 32)        0         
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 10, 19, 32)        0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 10, 19, 32)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 6080)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               778368    
_________________________________________________________________
activation_30 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               16512     
_________________________________________________________________
activation_31 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 12)                1548      
_________________________________________________________________
activation_32 (Activation)   (None, 12)                0         
=================================================================
Total params: 824,868
Trainable params: 824,680
Non-trainable params: 188
_________________________________________________________________
