_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_6 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_33 (Activation)   (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_34 (Activation)   (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_35 (Activation)   (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 22, 41, 32)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 28864)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 128)               3694720   
_________________________________________________________________
activation_36 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 12)                1548      
_________________________________________________________________
activation_37 (Activation)   (None, 12)                0         
=================================================================
Total params: 3,715,460
Trainable params: 3,715,272
Non-trainable params: 188
_________________________________________________________________
