_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_1 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_1 (Activation)    (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_2 (Activation)    (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_3 (Activation)    (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 22, 41, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 39, 32)        9248      
_________________________________________________________________
activation_4 (Activation)    (None, 20, 39, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 19, 32)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 10, 19, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6080)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 12)                72972     
_________________________________________________________________
activation_5 (Activation)    (None, 12)                0         
=================================================================
Total params: 101,412
Trainable params: 101,224
Non-trainable params: 188
_________________________________________________________________
