_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_3 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_13 (Activation)   (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_14 (Activation)   (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_15 (Activation)   (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 22, 41, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 20, 39, 32)        9248      
_________________________________________________________________
activation_16 (Activation)   (None, 20, 39, 32)        0         
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 10, 19, 32)        0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 10, 19, 32)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 6080)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                389184    
_________________________________________________________________
activation_17 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               8320      
_________________________________________________________________
activation_18 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 12)                1548      
_________________________________________________________________
activation_19 (Activation)   (None, 12)                0         
=================================================================
Total params: 427,492
Trainable params: 427,304
Non-trainable params: 188
_________________________________________________________________
