_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_6 (Activation)    (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_7 (Activation)    (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_8 (Activation)    (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 22, 41, 32)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 39, 32)        9248      
_________________________________________________________________
activation_9 (Activation)    (None, 20, 39, 32)        0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 10, 19, 32)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 10, 19, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 17, 32)         9248      
_________________________________________________________________
activation_10 (Activation)   (None, 8, 17, 32)         0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 4, 8, 32)          0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 4, 8, 32)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               131200    
_________________________________________________________________
activation_11 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 12)                1548      
_________________________________________________________________
activation_12 (Activation)   (None, 12)                0         
=================================================================
Total params: 170,436
Trainable params: 170,248
Non-trainable params: 188
_________________________________________________________________
