_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 94, 171, 32)       320       
_________________________________________________________________
batch_normalization_4 (Batch (None, 94, 171, 32)       376       
_________________________________________________________________
activation_20 (Activation)   (None, 94, 171, 32)       0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 92, 169, 32)       9248      
_________________________________________________________________
activation_21 (Activation)   (None, 92, 169, 32)       0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 46, 84, 32)        0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 46, 84, 32)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 44, 82, 32)        9248      
_________________________________________________________________
activation_22 (Activation)   (None, 44, 82, 32)        0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 22, 41, 32)        0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 22, 41, 32)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 20, 39, 32)        9248      
_________________________________________________________________
activation_23 (Activation)   (None, 20, 39, 32)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 10, 19, 32)        0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 10, 19, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 6080)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               778368    
_________________________________________________________________
activation_24 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 12)                1548      
_________________________________________________________________
activation_25 (Activation)   (None, 12)                0         
=================================================================
Total params: 808,356
Trainable params: 808,168
Non-trainable params: 188
_________________________________________________________________
